<template>
    <h2>Задание первое: Базовые команды</h2>
    <div class="descripton">
        Вы присоединились к команде разработчиков нового интернет магазина. Вы будете работать в команде, в которой уже работал опытный тимлид.
        Тимлид дал вам задание начать разработку нового проекта. Для этого нужно добавить несколько файлов.
        Тимлид любит чтобы все изменения вносились атомарно, поэтому дал подробную инструкцию.
    </div>
    <div class="joke">
        Это шуточное задание. Код с которым вы будете взаимодействовать — не рабочий. Это сделано осознанно, чтобы вы не вдавались в нюансы реализации, а работали именно с гитом. Сам интернет магазин писать не нужно.

    </div>
    <ul class="tasks">
        <li>Создать ветку c названием <code>dev</code> на основе ветки <code>main</code>.</li>
        <li>Добавить в корень репозитория файл <code>index.js</code>.</li>
        <li>Сделать коммит c сообщением <span class="msg">1 index</span>.</li>
        <li>Добавить в корень репозитория файл <code>style.css</code>.</li>
        <li>Сделать коммит c сообщением <span class="msg">2 style</span>.</li>
        <li>Добавить в корень репозитория файл <code>index.html</code>.</li>
        <li>Сделать коммит c сообщением <span class="msg">3 html</span>.</li>
        <li>Добавить в корень репозитория файл <code>config.js</code>.</li>
        <li>Сделать коммит c сообщением <span class="msg">4 config</span>.</li>
        <li>Добавить в корень репозитория файл <code>api.js</code>.</li>
        <li>Сделать коммит c сообщением <span class="msg">5 api</span>.</li>
        <li>Сделать пуш в свой репозиторий.</li>
    </ul>
</template>
