<template>
    <h2>Задание первое: Базовые команды</h2>
    <div>
        Ты присоединился к команде разработчиков нового интернет магазина. Ты присоединился к команде, в которой уже работал опытный тимлид.
        Тимлид дал тебе задание начать разработку нового проекта. Для этого нужно добавить несколько файлов.
        Тимлид любит чтобы все изменения вносились атомарно, поэтому дал подробную инструкцию.
        Это шуточное задание. Код с которым вы будете взаимодействовать — не рабочий. Это сделано осознанно, чтобы вы не вдавались в нюансы реализации, а работали именно с гитов. Сам интернет магазин писать не нужно.

    </div>
    <ul class="tasks">
        <li>Создать ветку c названием <span class="code">dev</span> на основе ветки main</li>
        <li>Добавить в корень репозитория файл <span class="code">index.js</span></li>
        <li>Сделать коммит c сообщением <span class="msg">1 index</span></li>
        <li>Добавить в корень репозитория файл <span class="code">style.css</span></li>
        <li>Сделать коммит c сообщением <span class="msg">2 style</span></li>
        <li>Добавить в корень репозитория файл <span class="code">index.html</span></li>
        <li>Сделать коммит c сообщением <span class="msg">3 html</span></li>
        <li>Добавить в корень репозитория файл <span class="code">config.js</span></li>
        <li>Сделать коммит c сообщением <span class="msg">4 config</span></li>
        <li>Добавить в корень репозитория файл <span class="code">api.js</span></li>
        <li>Сделать коммит c сообщением <span class="msg">5 api</span></li>
        <li>Сделать пуш в свой репозиторий</li>
    </ul>
</template>
