<template>
    <h2>Задание пятое: Ребейз</h2>
    <div>
        Наш код уже на проде!
        Пользователей все больше и больше. Им нужны новые фичи и срочно!
        Оказалось твой коллега занимался похожей фичей и написал кучу полезного кода! 
        Но случайно уехал в тайланд на ПМЖ. 
    </div>
    <ul class="tasks">
        <li> Переключись на ветку <span class="code">feature2</span></li>
        <li>Давай ребейзнемся на его ветку feature2_valera.</li>
        <li>Ожидаемый результат в ветке feature2 будут все коммиты ветки feature2_valera. </li>
        <li>Все конфликты реши в пользу ветки feature2.</li>
    </ul>
</template>