<template>
    <h2>Задание пятое: Ребейз</h2>
    <div>
        Наш код уже на проде!
        Пользователей все больше и больше. Им нужны новые фичи и срочно!
        Оказалось ваш коллега занимался похожей фичей и написал кучу полезного кода.
        Но случайно уехал в тайланд на ПМЖ.
    </div>
    <ul class="tasks">
        <li>Переключитесь на ветку <code>feature2</code>.</li>
        <li>Давайте сделаем ребейз на его ветку <code>feature2_valera.</code></li>
        <li>Ожидаемый результат в ветке <code>feature2</code> будут все коммиты ветки <code>feature2_valera</code>.</li>
        <li>Все конфликты нужно решить в пользу ветки <code>feature2</code>.</li>
    </ul>
</template>
