<template>
    <h2>Задание второе: Гитигнор</h2>
    <div>
        Произошла утечка исходного кода и теперь инженеры по безопасности запрещают хранить конфиги в гите.
    </div>
    <ul class="tasks">
        <li>Отведите ветку <code>secure</code> от ветки <code>dev</code>, которую создали в предыдщуем задании.</li>
        <li>Добавьте все возможные файлы с названием <code>config.js</code> в гитигнор, где бы они не размещались. </li>
        <li>Также сделайте чтобы папки <code>secure</code>, <code>secret</code> и файлы с расширением <code>.hacker</code> тоже игнорировались.</li>
        <li>Сам файл <code>config.js</code> из репозитория нужно тоже удалить (историю коммитов трогать не нужно).</li>
        <li>Сделай новый коммит c сообщением <span class="msg">6 secure</span>.</li>
        <li>Сделать пуш в свой репозиторий.</li>
    </ul>
</template>
