<template>
    <h2>Задание третье: Редактирование истории</h2>
    <div>
        У нас сменился тимлид. Первым делом он прошелся по истории гита и обратил внимание на то что коммиты 2й и 3й лучше бы объединить, а 4й вообще удалить из истории.
    </div>
    <ul class="tasks">
        <li>Создайте новую ветку <code>dev_2</code> на том же месте куда указывает ветка <code>dev</code>.</li>
        <li>Измените историю ветки <code>dev_2</code> так чтобы в ветке <code>dev_2</code> стало 3 коммита:
            <div class="msg">1 index</div>
            <div class="msg">2 style, html</div>
            <div class="msg">3 api</div>
        </li>
    </ul>
</template>
